//public class FirstClassInfo {
//
//    public static void main() {
//        /// Приметивные типы даннх
//        // Целочисленные типы - отличаются диапзоном
//        byte aByte = 0; // 8 бита 128 +127
//        0 // Целочисленный литерал
//        short sShort = 0; // 16 биа -32768 +32767
//        int aInt = 0; // 32 бита   (-2 в степени 32) .. +2 в степени 32 - 1
//        Integer
//        long aLong = 0; // 64 бита  (-2 в степени 64) .. +2 в степени 64 - 1
//
//        // Типы с плавающей точкой
//        float aFloat = 0.0F;
//        double aDouble = 0.0;
//
//        // Символьный (целочисленный)
//        char aChar = 'a';
//        Character
//// любой из приметивных типов данных можно заменить объектами
//
//
//        // Логический
//        boolean aBoolean = true;
//        Boolean booleanWrapper = 'a';
//
//
//        /// Объектные / ссылочные типы данных
//        // Строка ( и бесконченость других обхекьных/ссылочных данных)
//        String toBePrint = "Hello World";
//        // Hello World строковый литерал
//
//        /// Операторы
//        // Операторы присовения =
//        String name = "Литерал";
//        // Арефмитические опреаторы + - / * % ++ --
//        System.out.println(4.0 + 3);
//        // Операторы сравения > < >= <= != ==
//        // Логические операторы  & | && || !
//
//        // Тернарный оператор
//
//        char sex = 'm';
//        String childName = sex == 'm'
//                ? "Valentin"
//                : "Valentina";
//
//        // Управляющая конструкция if
//
//        if (sex == 'm') {
//            childName = "Valentin";
//        } else if (sex == 'w') {
//            childName = "Valentina";
//        }
//
//        // ключевое слово new
//
//        String name = new String("Valery");
//        String name = "Valery";
//
////Прочитать:
//        //      Литералы, порядок операторов их приоритет , if else
//
//
//    }
//}
